# _*_ coding:utf-8 _*_

import numpy as np
from numpy import random


def city_random_generator(nums):
    """
    随机生成nums个城市数据
    :param nums: 城市个数
    :return: nums个城市数据
    """
    citys = []
    n = 0
    while n < nums:
        x = random.randn()
        y = random.randn()
        if [x, y] not in citys:
            citys.append([x, y])
            n = n + 1
    return np.array(citys)


def city10():
    """
    10个城市数据，坐标数据都在[0, 1]范围内
    :return: 10个城市数据
    """
    citys = np.array([[0.4000, 0.4439], [0.2439, 0.1463], [0.1707, 0.2293], [0.2293, 0.7610], [0.5171, 0.9414],
                      [0.8732, 0.6536], [0.6878, 0.5219], [0.8488, 0.3609], [0.6683, 0.2536], [0.6195, 0.2634]])
    return citys


def city52():
    """
    来源于网上的52个城市数据
    :return: 52个城市数据
    """
    citys = np.array([[565.0, 575.0], [25.0, 185.0], [345.0, 750.0], [945.0, 685.0], [845.0, 655.0],
                      [880.0, 660.0], [25.0, 230.0], [525.0, 1000.0], [580.0, 1175.0], [650.0, 1130.0],
                      [1605.0, 620.0], [1220.0, 580.0], [1465.0, 200.0], [1530.0, 5.0], [845.0, 680.0],
                      [725.0, 370.0], [145.0, 665.0], [415.0, 635.0], [510.0, 875.0], [560.0, 365.0],
                      [300.0, 465.0], [520.0, 585.0], [480.0, 415.0], [835.0, 625.0], [975.0, 580.0],
                      [1215.0, 245.0], [1320.0, 315.0], [1250.0, 400.0], [660.0, 180.0], [410.0, 250.0],
                      [420.0, 555.0], [575.0, 665.0], [1150.0, 1160.0], [700.0, 580.0], [685.0, 595.0],
                      [685.0, 610.0], [770.0, 610.0], [795.0, 645.0], [720.0, 635.0], [760.0, 650.0],
                      [475.0, 960.0], [95.0, 260.0], [875.0, 920.0], [700.0, 500.0], [555.0, 815.0],
                      [830.0, 485.0], [1170.0, 65.0], [830.0, 610.0], [605.0, 625.0], [595.0, 360.0],
                      [1340.0, 725.0], [1740.0, 245.0]])
    return citys


def china_citys():
    """
    中国34个城市的经纬度数据
    :return: 34个城市数据
    """
    citys = []
    f = open("./datas/ChinaCitys.txt", "r", encoding='UTF-8')
    while True:
        city = str(f.readline())
        if not city: break
        city = city.replace("\n", "")
        city = city.split("\t")
        citys.append([float(city[1]), float(city[2])])
    return np.array(citys)